#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <string.h>
//int main()
//{
//	int ret = 9 / 2;
//	printf("%d", ret);//4
//	//除号两边都是整数，执行整数除法
//	double ret2 = 9 / 2.0;
//	printf("%lf", ret2);//4.500000
//	//操作数中有浮点数则进行浮点数除法
//	return 0;
//}


//int main()
//{
//	int ret = 9 % 2;
//	printf("%d\n", ret);
//	//整除之后看余数
//	double ret = 9.0 % 2;//err
//
//	return 0;
//}



//左右移位操作符
//int main()
//{
//	//<< -- 左移操作符
//	//>> -- 右移操作符
//
//	int a = 5;//4byte - 32bit 
//	int b = a << 1;
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	//00000000 00000000 00000000 00000101
//	//00000000 00000000 00000000 00001010
//	
//
//	int c = -1;
//	int d = c << 1;
//	printf("%d\n", d);
//
//	//10000000 00000000 00000000 00000001 - yuan
//	//11111111 11111111 11111111 11111110 - fan
//	//11111111 11111111 11111111 11111111 - bu
//	//11111111 11111111 11111111 11111110 - bu
//	//11111111 11111111 11111111 11111101 - fan 
//	//10000000 00000000 00000000 00000010 - yuan
//
//
//	//移位操作符，移动的是二进制位
//	//负数
//	//原码 - 直接数字的正负写出的二进制序列
//	//反码 - 符号位不变，其他位按位取反
//	//反码+1
//  
//	return 0;
//}

//int main()
//{
//	//int a = 5;
//	//int b = a >> 1;
//	//逻辑右移
//	//右边丢弃，左边补0
//	//算术右移
//	//右边丢弃，左边补原符号位
//	int a = -1;
//	printf("%d\n", a >> 1);
//	//10000000 00000000 00000000 00000001 - -1
//	//11111111 11111111 11111111 11111110 - fan 
//	//11111111 11111111 11111111 11111111 - bu
//	//11111111 11111111 11111111 11111111 - bu
//	
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = a >> 1;
//
//	float c = 4.5f;
//	//c >> 1;//err
//
//	return 0;
//}


//int main()
//{
//	//& - 按位与
//	//| - 按位或
//	//^ - 按位异或
//
//	//int a = 3;
//	//int b = -2;
//	//int c = a & b;
//
//	//000000000 000000000 000000000 000000011 - 3
//	//100000000 000000000 000000000 000000010 - -2yuan
//	//111111111 111111111 111111111 111111101 - -2fan
//	//111111111 111111111 111111111 111111110 - -2bu
//  
//	//111111111 111111111 111111111 111111110 - -2bu
//	//000000000 000000000 000000000 000000011 -  3bu
//	//000000000 000000000 000000000 000000010 - 所得数的补码
//	//printf("%d\n", c);//2
//
//	//int a = 3;
//	//int b = -2;
//	//int c = a | b;
//	//111111111 111111111 111111111 111111110 - -2的补码
//	//000000000 000000000 000000000 000000011 -  3的补码
//	//111111111 111111111 111111111 111111111 - 所得数的补码
//	//100000000 000000000 000000000 000000001 - -1
//	//printf("%d\n", c);//-1
//
//	int a = 3;
//	int b = -2;
//	int c = a ^ b;
//	//111111111 111111111 111111111 111111110 - -2的补码
//	//000000000 000000000 000000000 000000011 -  3的补码
//	//111111111 111111111 111111111 111111101 - 所得数的补码 
//	//100000000 000000000 000000000 000000010
//	//100000000 000000000 000000000 000000011 - -3
//	printf("%d\n", c);
//
//
//	return 0;
//}

//void print(a)
//{
//	a >> 1;
//}
//int main()
//{
//	int a = 15;
//	//int b = a & 1;
//	//printf("%d\n", b);
//	int i = 32;
//	if (i--)
//	{
//		print(a);
//	}
//	printf("%d", a & 1);
//
//	return 0;
//}


//void Print(int a)
//{
//	int i = 32;
//	if (i--)
//	{
//		return Print(a >> 1);
//	}
//	printf("%d", a >> 1);
//}
//
//int main()
//{
//	int a = 11;
//	//for (int i = 32; i > 0; i--)
//	//{
//	//	printf("%d", a & 1);
//	//	a = a >> 1;
//	//}
//
//
//	Print(a);
//	return 0;
//}

//int main()
//{
//	int a = 15;
//	int i = 32;
//	while (i)
//	{
//		printf("%d", a & 1);
//		a = a >> 1;
//		i--;
//	}
//
//	return 0;
//}



//int main()
//{
//	int a = 10;
//	int b = 20;
//	printf("a=%d,b=%d\n", a, b);
//	a = a + b;
//	b = a - b;//(a+b)-b = a
//	a = a - b;//(a+b)-a = b
//	printf("a=%d,b=%d\n", a, b);
//  //溢出风险
//	return 0;
//}



//int main()
//{
//	int a = 10;
//	int b = 20;
//	printf("a=%d,b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;//(a ^ b) ^ b = a
//	a = a ^ b;//(a ^ b) ^ a = b
//	printf("a=%d,b=%d\n", a, b);
//
//	return 0;
//}

//
//int main()
//{
//	int a = 15;
//	int i = 32;
//	int count = 0;
//	while (i--)
//	{
//		if ((a & 1) == 1)
//		{
//			count++;
//		}
//		a = a >> 1;
//	}
//	printf("%d\n", count);
//
//	return 0;
//}



//int main()
//{
//	int num = 15;
//	int count = 0;
//	for (int i = 0; i < 32; i++)
//	{
//		if (((num >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//	printf("%d\n", count);
//
//	return 0;
//}
 
//int main()
//{
//	int a = 10;
//	int x = 0;
//	int y = 20;
//	a = x = y + 1;//连续赋值
//	printf("%d\n", a);
//
//	return 0;
//}

//int main()
//{
//	//int a = 0;
//	//printf("%d\n", !a);
//
//	//if (-1)
//	//{
//	//	printf("hehe\n");
//	//}
//
//	//int a = 10;
//	//printf("%d\n", a);
//	//a = -a;
//	//printf("%d\n", a);
//	
//	//int a = 10;
//	//int* p = &a;//* 说明p为指针变量 & 说明p中存储的是a的地址
//	//*p = 20;//解引用访问其存储的地址中的内容
//	//printf("%d\n", *p);
//
//	//int b = *p;
//	//printf("%d\n", b);
//
//	return 0;
//}

//
//int main()
//{
//	int arr[10] = { 0 };
//
//	arr;//数组首元素的地址
//	printf("%p\n", arr + 1);
//	&arr[0];//数组首元素的地址
//	printf("%p\n", &arr[0] + 1);
//	&arr;//取出整个数组的地址
//	printf("%p\n", &arr + 1);
//
//	return 0;
//}


//sizeof()操作符
//sizeof()计算变量或类型所占空间的大小，与其内容无关
//int main()
//{
//	char arr[10] = "abcd";
//	printf("%d\n", sizeof(arr));
//	printf("%d\n", sizeof arr);
//	printf("%d\n", strlen(arr));
//	
//
//	return 0;
//}


//int main()
//{
//	int a = 5;
//	short s = 10;
//	printf("%d\n", sizeof(s = a + 2));
//	printf("%d\n", sizeof(s));
//
//
//
//	return 0;
//}


//int main()
//{
//	int a = 13;
//	//00000000 00000000 00000000 00001101 - 13
//	//00000000 00000000 00000000 00000010 - 1<<1
//	//00000000 00000000 00000000 00001111 - 15
//	int b = a | (1<<1);
//	printf("%d\n", b);
//
//	//00000000 00000000 00000000 00001111 - 15
//	//11111111 11111111 11111111 11111101 - ~(1<<1)
//	
//	int c = b & (~(1 << 1));
//	printf("%d\n", c);
//
//	return 0;
//}

//
//int main()
//{
//	int a = 0;
//	//int b = a++;
//	   
//	printf("%d\n", a);
//	int c = --a;
//	//printf("%d\n", b);
//	printf("%d\n", c);
//
//	return 0;
//}



//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));//(2)
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//(4)
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//(1)
//	printf("%d\n", sizeof(ch));//(3)
//	test1(arr);
//	test2(ch);
//
//	return 0;
//}


//int main()
//{
//	int arr[10] = { 0 };
//	for (int i = 0; i < 10; i++)
//	{
//		printf("%p --- %p\n", &i[arr], i+arr);
//	}
//
//	return 0;
//}
//

//void test()
//{
//	printf("hehe\n");
//
//}
//int main()
//{
//	//printf("%d\n",strlen("abc"));
//	printf("%u\n", strlen("abc"));
//	test();
//
//	return 0;
//}

//struct Book
//{
//	char name[50];
//	char id[15];
//	float price;
//};
//
//Print1(struct Book b1)
//{
//	printf("书名为：%s\n", b1.name);
//	printf("价格为：%f\n", b1.price);
//	printf("书号为：%s\n", b1.id);
//}
//Print2(struct Book* pb)
//{
//	printf("书名为：%s\n", (*pb).name);
//	printf("价格为：%f\n", (*pb).price);
//	printf("书号为：%s\n", (*pb).id);
//}
//Print3(struct Book* pb)
//{
//	printf("书名为：%s\n", pb->name);
//	printf("价格为：%f\n", pb->price);
//	printf("书号为：%s\n", pb->id);
//}
//
//int main()
//{
//	struct Book b1 = { "谭浩强C语言程序设计",55.5f,"2020322222" };
//	b1.price = 300.0f; 
//	//*(b1.name) = "数据结构";//err
//
//	strcpy(b1.name, "数据结构");
//	Print1(b1);
//	Print2(&b1);
//	Print3(&b1);
//
//	return 0;
//}



//int main()
//{
//	char a = 3;
//	//00000011
//	char b = 127;
//	//01111111
//	char c = a + b;
//	//00000000 00000000 00000000 00000011 - int a
//	//00000000 00000000 00000000 01111111 - int b
//	//00000000 00000000 00000000 10000010 - int c
//	//10000010 - char c
//	printf("%d\n", c);
//	//11111111 11111111 11111111 10000010 - int c - 补码
//	//10000000 00000000 00000000 01111110 - int c - 原码 
//
//	return 0;
//}


//int main()
//{
//	char a = 0xb6;
//	//10110110
//	short b = 0xb600;
//	//10110110 00000000
//	int c = 0xb6000000;
//	//10110110 00000000 00000000 00000000
//	if (a == 0xb6)
//		//11111111 11111111 11111111 10110110 
//		//10000000 00000000 00000000 01001001
//		//10000000 00000000 00000000 01001010 - int a
//		//00000000 00000000 00000000 10110110 - 0xb6
//		printf("a");
//	if (b == 0xb600)
//		//11111111 11111111 10110110 00000000
//		//10000000 00000000 01001001 11111111
//		//10000000 00000000 01001010 00000000 - int b
//		//00000000 00000000 10110110 00000000 - 0xb600
//		printf("b");
//	if (c == 0xb60000)
//		//10110110 00000000 00000000 00000000 - int c
//		//10110110 00000000 00000000 00000000 - 0xb6000000
//		printf("c");
//
//	return 0;
//}

//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));
//	printf("%u\n", sizeof(+c));
//	printf("%u\n", sizeof(-c));
//
//
//
//	return 0;
//}

//int main()
//{
//	int a = 4;
//	float f = 4.5f;
//	f = a + f;
//	printf("%f\n", f);
//
//	return 0;
//}

//int main()
//{
//	int a = 1;
//	int i = 0;
//	a = (++i) + (++i) + (++i);
//}