#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

/**********************操作符****************************/
//算术操作符
int main()
{

	//除号任意两端有浮点数则，进行浮点数除法
	//全为整数则进行整数除法

	float a = 5 / 2;
	printf("%f\n", a);//2.0000

	float b = 5.0 / 2;
	printf("%f\n", b);//2.5000

	float c = 5 / 2.0;
	printf("%f\n", c);//2.5000

	float d = 5.0 / 2.0;
	printf("%f\n", d);//2.5000

	//取模得余数
	float e = 7 % 2;
	printf("%f\n", e);

	return 0;
}


//移位操作符
//作用于二进制位
// << - 左移操作符 - 二进制左移一位即十进制乘以二
// >> - 右移操作符
int main()
{

	//00000000 00000000 00000000 00001100 - 12
	//00000000 00000000 00000000 00011000 - 24
	int a = 12;
	int b = a << 1;
	printf("%d\n", b);

	//00000000 00000000 00000000 00000110 - 6
	//00000000 00000000 00000000 00001100 - 12
	int c = 6;
	int d = c << 1;
	printf("%d\n", d);

	//00000000 00000000 00000000 00000010 - 2
	//00000000 00000000 00000000 00000100 - 4
	int e = 2;
	int f = e << 1;
	printf("%d\n", f);

	//由2^0左移一位为2^1;
	//由2^1左移一位为2^2;
	//由2^2+2^3左移一位为2^3+2^4;
	
	//二进制左移一位即十进制乘以二
	return 0;
}


//位操作符
//按位与   &
//按位异或 ^
//按位或   |
//按二进制位
int main()
{
	int a = 3;
	int b = 5;
	//00000000000000000000000000000011 - a
	//00000000000000000000000000000101 - b
	//00000000000000000000000000000001 - a & b
	//对应的二进制位有0就为0，全是1则为1
	int c = a & b;
	printf("%d\n", c);//1


	//00000000000000000000000000000011 - a
	//00000000000000000000000000000101 - b
	//00000000000000000000000000000110 - a ^ b
	//对应的二进制位相同为0，相异为1
	int d = a ^ b;
	printf("%d\n", d);//6


	//00000000000000000000000000000011 - a
	//00000000000000000000000000000101 - b
    //00000000000000000000000000000111 - a | b
	//对应二进制位有1就是1，全为0才得0
	int e = a | b;
	printf("%d\n", e);//7
 

	return 0;
}


//赋值操作符
int main()
{
	int a = 10;//初始化
	
	a = 30;//赋值操作

	a += 10;//复合赋值
	a -= 10;
	a *= 10;
	a /= 10;
	a &= 1;
	a ^= 1;
	a |= 1;
	a <<= 1;


	return 0;
}

//单目操作符
//只有一个操作数

//a+b;对于+来说a和b为+的两个操作数
int main()
{
	//真与假
	//非0即真，0即假
	
	//逻辑反操作
	//真变假，假变真
	int a = 10;
	printf("%d\n", !a);//0

	int b = 0;
	printf("%d\n", !b);//1
	//假变真，规定都输出1

	//取正取负
	int c = 1;
	int d = -c;
	int e = +d;
	printf("%d\n", e);//-1,意义完全等同于数学上的正负号


	return 0;
}

int main()
{
	//sizeof计算变量所占空间大小
	int a = 10;
	printf("%d\n", sizeof(a));
	printf("%d\n", sizeof(int));


	//整数在内存中存储的时候，存储的是二进制
	//一个整数的二进制表示有3种形式：原码，反码，补码
	
	//正整数：原码，反码，补码相同；
	//负整数：原码，反码，补码需计算；

	//有符号的整数，最高位是0，表示为正，
	//              最高位是1，表示为负；
	
	//eg: 
	//  int a = 1;
	//00000000000000000000000000000001 - 原码
	//00000000000000000000000000000001 - 反码
	//00000000000000000000000000000001 - 补码

	//  int a = -1;
	//10000000000000000000000000000001 - 原码
	//11111111111111111111111111111110 - 反码 - 符号位不变，其他位按位取反
	//11111111111111111111111111111111 - 补码 - 反码+1

	//内存存储整数时，存储的是二进制的补码
	//计算时也是从补码开始计算

	//~按(二进制)位取反
	int b = 0;
	printf("%d\n", ~b);//-1

	//00000000000000000000000000000000 - 0的补码
	//11111111111111111111111111111111 - ~0的补码
	//11111111111111111111111111111110 - ~0的反码
	//10000000000000000000000000000001 - ~0的原码
	
	//故由0的补码得~0的补码，补码-1得反码，再（符号位不变）按位取反得原码；
	//最后原码代表的就是结果的二进制序列；


	return 0;

}



//++，--
int main()
{
	int a = 2;
	//a = a + 1;
	//a += 1;
	//printf("%d\n", a);

	//前置++；后置++；
	
	int c = ++a;//前置++;先++，后使用
	printf("++a=%d\n", c);//3
	printf("  a=%d\n", a);//3

	a = 2;
	int d = a++;//后置++；先使用，后++
	printf("a++=%d\n", d);//2
	printf("  a=%d\n", a);//3

	a = 2;
	int e = --a;//前置--；先--，后使用
	printf("--a=%d\n", e);//1
	printf("  a=%d\n", a);//1

	a = 2;
	int f = a--;//后置--；先使用，后--
	printf("a--=%d\n", f);//2
	printf("  a=%d\n", a);//1
	

	return 0;
}

//强制类型转换
int main()
{
	//int a = 3.14;// 从“double”转换到“int”，可能丢失数据
	int a = (int)3.14;
	printf("%d\n", a);//3,丢失数据


	return 0;
}

//逻辑操作符

int main()
{
	//逻辑与 - &&（并且）
	//逻辑或 - ||（或者）
	int a = 1;
	int b = 4;

	if ((a = 1) && (b = 4))
	{
		printf("&&\n");
	}
	
	if ((a = 3) || (b = 4))
	{
		printf("||\n");
	}

	return 0;
}


//条件操作符（三目操作符）
int main()
{
	int a = 10;
	int b = 0;

	//if (a == 5)
	//{
	//	b = -6;
	//}
	//else
	//{
	//	b = 6;
	//}
	b = (a = 5) ? (6) : (-6);
	printf("%d\n", b);

	return 0;
}


//逗号表达式
//( , , ... , );
//表达式从左向右计算，整个表达式的结果为最后一个表达式的值
int main()
{
	int a = 0;
	int b = 3;
	int c = -1;
	
	int d = (a = b - 5, b = a + c, c = a + b, c -= 5);
	printf("%d\n", d);

	return 0;
}


//下标引用，函数调用和结构成员

void test()
{

}
int main()
{
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	//下标0~9
	printf("%d\n",arr[9]);//[]下标引用操作符

	printf("函数调用操作符()\n");//()函数调用操作符
	test();


	return 0;

}

/***********************常见关键字********************************/

//break case const default do...while enum for goto if signed unsigned sizeof union volatile 
//auto register extern static typedef 

//typedef 变量类型重命名
typedef unsigned int unint;

int main()
{
	//auto
	auto int a = 10;//局部变量,自动创建，自动销毁
	//一般省略
	
	//typedef
	unsigned int num = 1000;
	unint num1 = 1000;


	//register
	//建议将num2存放再寄存器中，编译器最终决定
	register int num2 = 100;
	&num2;//ERR，寄存器上的变量无法用&取地址

	return 0;
}

//static
	//static的用法
	//1.修饰局部变量
	//2.修饰全局变量 
	//3.修饰函数

//声明外部变量
//默认全局变量具有外部链接属性，只需extern声明一下
extern int g_val;
//声明外部函数
extern int Add(int, int);


void test()
{
	//static修饰局部变量
	//使局部变量出作用域后不被销毁
	//改变其生命周期，不影响作用域（出作用域虽不销毁，但仍不可使用）

	static int a = 1;
	a++;
	printf("%d ", a);
}

int main() 
{
	int i = 0;

	while (i < 10)
	{
		test();
		i++;
	}
	//static修饰全局变量
	printf("%d\n", g_val);


	int a = 10;
	int b = 20;
	//static修饰的函数
	int c = Add(a, b);
	printf("%d\n", c);


	return 0;
}



/********************#define定义常量和宏***************************/

//定义常量
#define NUM 100
//定义宏
#define MAX(X,Y) (X>Y?X:Y)

int main()
{
	printf("%d\n", NUM);
	
	int a = 0;
	int b = 10;
	
	int c = MAX(a, b);
	
	//实际操作，替换宏体
	//int c = (a > b ? a : b);
	
	printf("%d\n", c);

	return 0;
}




